id: 6235a7c6-953a-4603-a1b9-f9daee988e9a
name: Successfully sign-in from privileged user with password authentication (no password-less sign-in)
description: |
  'Using Sentinel Watchlist with all privileged accounts to search for Password-based and successful authentication (without FIDO2 or WHfB sign-in)'
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - SigninLogs
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AADNonInteractiveUserSignInLogs
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
  - CredentialAccess
relevantTechniques:
  - T1078
  - T1110
query: |
  _GetWatchlist('IdentityCorrelation')
  | extend UserPrincipalName = "Associated Privileged Account"
  | join
  (
  union AADNonInteractiveUserSignInLogs, SigninLogs
  | where AuthenticationDetails contains "Password" and ResultType == "0"
  ) on $left.UserPrincipalName == $right.UserPrincipalName
  | extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
version: 1.1.1
kind: Scheduled