SigninLogs
| extend authenticationMethodDetails = tostring(parse_json(AuthenticationDetails)[0].authenticationMethod) 
| where authenticationMethodDetails contains "Fido" or authenticationMethodDetails contains "RemoteNGC"
| where RiskLevelDuringSignIn != "none"
| project UserPrincipalName, IPAddress
