id: d52eda99-4510-49a5-b6ad-cb30edaba950
name: Blocked attempts of self-service password reset (SSPR) by user
description: |
  'Identifies when Azure AD SSPR blocks or throttle user attempts to reset password of a user.
  This may indicate a malicious attempt at guessing answers of security questions based on social engineering or stolen personal information.'
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
  - CredentialAccess
relevantTechniques:
  - T1078
  - T1110
query: |
  // Get events of SSPR blocked activities within the number of days (timeframe)
  let timeRange = 1d;
  AuditLogs
  | where TimeGenerated >= ago(timeRange)
  | where LoggedByService == "Self-service Password Management" 
  | where OperationName has "blocked" or ResultReason has "blocked"
  | mv-expand TargetResources
  | mv-expand InitiatedBy
  | extend TargetUserPrincipalName = tostring(TargetResources.userPrincipalName)
  | extend ActorUserPrincipalName = tostring(InitiatedBy.user.userPrincipalName)
  | extend ActorIPAddress = tostring(InitiatedBy.user.ipAddress)
  | project TimeGenerated, ActorUserPrincipalName, TargetUserPrincipalName, ActorIPAddress, OperationName, ResultReason
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: TargetUserPrincipalName
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: ActorIPAddress
customDetails:
  OperationName: OperationName
  ResultReason: ResultReason
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: true
    reopenClosedIncident: false
    lookbackDuration: 5m
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
eventGroupingSettings:
  aggregationKind: AlertPerResult
version: 1.1.0
kind: Scheduled
