
id: 86e9ba6f-d1ed-48b8-a849-c26f77db8c1b
name: Detection of Azure AD connector accounts outside of WatchLists
description: |
  'List of objects with Directory role membership to "Directory Synchronization" or naming similar to AAD connector account which aren't stored in the WatchList was found. Indicator of creating AAD connector account as backdoor.'
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
queryFrequency: 1d
queryPeriod: 1d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - CredentialAccess
  - DefenseEvasion
relevantTechniques:
  - T1528
  - T1550
query: |
  let DirSyncRoleAssignedMembers = (IdentityInfo 
  | where AssignedRoles contains "Directory Synchronization Accounts" 
  | summarize by AccountObjectId, AccountUPN = tolower(AccountUPN)); 
  let DirSyncNamedUsers = (union isfuzzy=true AADNonInteractiveUserSignInLogs, SigninLogs
  | where UserPrincipalName startswith "sync_" and UserPrincipalName endswith "onmicrosoft.com"
  | summarize by AccountObjectId = UserId, AccountUPN = tolower(UserPrincipalName));
  let WatchList = _GetWatchlist('ServiceAccounts') | where ['Tags'] == "Azure AD Connect" | project AccountObjectId = ['Service AAD Object Id'];
  union isfuzzy=true DirSyncRoleAssignedMembers,DirSyncNamedUsers
  | distinct tostring(AccountObjectId), AccountUPN
  | where AccountObjectId in (!WatchList)
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
version: 1.0.0








