id: 1e8dd897-2f78-4e17-8b81-b6fda4e1a968
name: Token Replay from workload identity with privileges in Microsoft Azure (WorkloadIdentityInfo)
version: 1.0.0
kind: Scheduled
description: Detected indicator of token replay attack by using the following pattern. A token has been used for activity on Azure resource(s) from a different IP address than during the sign-in process. Severity is set to "high" if activity IP address is not related to a service tag IP address range.
severity: Medium
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
tactics:
- Persistence
- PrivilegeEscalation
relevantTechniques:
- T1078
query: |
  let azure_ranges = externaldata(changeNumber: string, cloud: string, values: dynamic)
    ["https://raw.githubusercontent.com/microsoft/mstic/master/PublicFeeds/MSFTIPRanges/ServiceTags_Public.json"] with(format='multijson')
    | mv-expand values
    | mv-expand values.properties.addressPrefixes
    | mv-expand values_properties_addressPrefixes
    | summarize by tostring(values_properties_addressPrefixes)
    | extend isipv4 = parse_ipv4(values_properties_addressPrefixes)
    | extend isipv6 = parse_ipv6(values_properties_addressPrefixes)
    | extend ip_type = case(isnotnull(isipv4), "v4", "v6")
    | summarize make_list(values_properties_addressPrefixes) by ip_type;
  AzureActivity
  | where parse_json(tostring(Authorization_d.evidence)).principalType == "ServicePrincipal"
  | extend ClaimsObjectIdentifier = parse_json(Claims).["http://schemas.microsoft.com/identity/claims/objectidentifier"] 
  | extend parsedClaims = parse_json(Claims_d)
  | where ActivityStatusValue == "Success" and ActivitySubstatusValue == "OK"
  | project
      TimeGenerated,
      CorrelationId,
      OperationName,
      ResourceProviderValue,
      _ResourceId,
      ActivityIpAddress = CallerIpAddress,
      ApplicationId = tostring(Claims_d.appid),
      Uti = tostring(Claims_d.uti),
      ActivityStatus
  | join kind=inner (union AADServicePrincipalSignInLogs, AADManagedIdentitySignInLogs
      | project
          ConditionalAccessPolicies,
          ConditionalAccessStatus,
          ServicePrincipalCredentialKeyId,
          SignInIpAddress = IPAddress,
          UniqueTokenIdentifier
      )
      on $left.Uti == $right.UniqueTokenIdentifier
  | where ActivityIpAddress != SignInIpAddress and SignInIpAddress != ""
  | extend isipv4 = parse_ipv4(ActivityIpAddress)
  | extend ip_type = case(isnotnull(isipv4), "v4", "v6")
  | join kind=fullouter (azure_ranges) on ip_type
  | extend ipv6_match = ipv6_is_in_any_range(ActivityIpAddress, list_values_properties_addressPrefixes)
  | extend ipv4_match = ipv4_is_in_any_range(ActivityIpAddress, list_values_properties_addressPrefixes)
  | extend IpAddressType = iff(ipv4_match or ipv6_match, "Azure Public IP", "None Azure IP")
  | where isnotempty(ApplicationId)
  | join kind=leftouter(
      PrivilegedWorkloadIdentityInfo
      | project
          WorkloadIdentityName,
          WorkloadIdentityType,
          ApplicationObjectId,
          ServicePrincipalObjectId,
          ApplicationId,
          IsFirstPartyApp,
          EntraIdRoles,
          AppRolePermissions,
          WorkloadIdClassification = EnterpriseAccessModelTiering
      )
      on ApplicationId
  | extend Severity = iff(IpAddressType != "Azure Public IP", "High", "Medium")
suppressionEnabled: false
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: true
    reopenClosedIncident: false
    lookbackDuration: 5h
    matchingMethod: Selected
    groupByEntities:
    - CloudApplication
    groupByAlertDetails: []
    groupByCustomDetails: []
eventGroupingSettings:
  aggregationKind: AlertPerResult
alertDetailsOverride:
  alertDisplayNameFormat: Token Replay from workload identity with privileges in Microsoft Azure
  alertDescriptionFormat: Activity of {{WorkloadIdentityName}} from IPAddress {{ActivityIpAddress}} ({{IpAddressType}}) has been detected which is different than the IP address from sign-in event.
  alertSeverityColumnName: Severity
  alertDynamicProperties: []
customDetails:
  WorkloadIdentityName: WorkloadIdentityName
  WorkloadIdentityType: WorkloadIdentityType
  ServicePrincipalId: ServicePrincipalObjectId
  ApplicationId: ApplicationId
  CredentialKeyId: ServicePrincipalCredentialKeyId
  IsFirstPartyApp: IsFirstPartyApp
  PrivilegedAccess: WorkloadIdClassification
  EntraDirectoryRoles: EntraIdRoles
  MSGraphRoles: AppRolePermissions
  ConditionalAccess: ConditionalAccessStatus
entityMappings:
- entityType: CloudApplication
  fieldMappings:
  - identifier: Name
    columnName: WorkloadIdentityName
- entityType: CloudApplication
  fieldMappings:
  - identifier: AppId
    columnName: ApplicationId
- entityType: IP
  fieldMappings:
  - identifier: Address
    columnName: ActivityIpAddress
- entityType: IP
  fieldMappings:
  - identifier: Address
    columnName: SignInIpAddress
- entityType: AzureResource
  fieldMappings:
  - identifier: ResourceId
    columnName: _ResourceId
suppressionDuration: 5h

